package com.example.mvi.data

import com.example.mvi.domain.Book

class LibraryDataSource{
    fun getAllBooks(): List<Book>{
        return listOf( Book("Преступление и наказание", "Ф. Достоевский", 450),
            Book("Анна Каренина", "Л. Толстой", 520),
            Book("Братья Карамазовы", "Ф. Достоевский", 600),
            Book("Война и мир", "Л. Толстой", 850),
            Book("Доктор Живаго", "Б. Пастернак", 480),
            Book("Лолита", "В. Набоков", 430),
            Book("Мастер и Маргарита", "М. Булгаков", 620),
            Book("Собачье сердце", "М. Булгаков", 350),
            Book("Великий Гэтсби", "Ф. Фицджеральд", 390),
            Book("1984", "Дж. Оруэлл", 410),
            Book("Убить пересмешника", "Харпер Ли", 440),
            Book("Гордость и предубеждение", "Джейн Остин", 380),
            Book("Дневник Анны Франк", "Анна Франк", 300),
            Book("Гарри Поттер", "Дж. Роулинг", 990),
            Book("Властелин колец", "Дж. Р. Р. Толкин", 1200),
            Book("Маленький принц", "А. де Сент-Экзюпери", 250),
            Book("Алхимик", "Пауло Коэльо", 340),
            Book("Зеленая миля", "Стивен Кинг", 550),
            Book("Унесенные ветром", "Маргарет Митчелл", 700),
            Book("Сто лет одиночества", "Г. Маркес", 580),
            Book("Божественная комедия", "Данте Алигьери", 650),
            Book("Одиссея", "Гомер", 400),
            Book("Дон Кихот", "Мигель де Сервантес", 520),
            Book("Триумфальная арка", "Э. М. Ремарк", 460),
            Book("Над пропастью во ржи", "Дж. Сэлинджер", 370),
            Book("Метро 2033", "Дмитрий Глуховский", 500),
            Book("Пикник на обочине", "Братья Стругацкие", 420),
            Book("Трудно быть богом", "Братья Стругацкие", 410),
            Book("451 градус по Фаренгейту", "Рэй Брэдбери", 390),
            Book("Заводной апельсин", "Энтони Бёрджесс", 360),
            Book("Портрет Дориана Грея", "Оскар Уайльд", 400),
            Book("Код да Винчи", "Дэн Брэун", 590),
            Book("Sapiens", "Юваль Ной Харари", 800),
            Book("Думай медленно, решай быстро", "Даниэль Канеман", 950))
    }
}